/* 
1. Callback & Higher-Order Function มีข้อดีอย่างไร
Answer: ข้อดี คือ การแยกหน้าที่การทำงานของ function ออกเป็นส่วน ๆ 
เช่น callback function มีหน้าที่ ทำตามเงื่อนไขย่อย ๆ ที่เราต้องการ
ส่วน High-Order Function มีหน้าที่เรียกคำสั่งย่อย ๆ นั่นมาทำงานให้เป็นระบบ
หรือเรียกได้ศูนย์รวมการทำงาน Function หลัก


2. จากการลองใช้ Callback Function ในระบบเกมและระบบแจ้งเตือน คุณคิดว่าโค้ดอ่านง่ายขึ้นหรือไม่ เพราะอะไร 
Answer: code อ่านง่ายชึ้น เแต่เราต้องตั้งชื่อ Callback Function ให้ชัดเจน 
รวมถึงต้องระบุหน้าที่ของแต่ละ Callback Fucntion ให้ชัดเจน
และเข้าใจจุดประสงค์ Higher-Order Function ด้วย เพื่อจะเขียน logic ได้ถูกต้อง ไม่สบสน


3. หากต้องสอนเพื่อนให้เข้าใจ Callback & Higher-Order Function ใน 5 นาที จะอธิบายอย่างไร 
Answer:  ผมจะอธิบาย โดยสมมุติว่า เป็นการทำข้าวผัดกระเพรา โดยในห้องครัวจะมี เซฟหลัก และ เซฟรอง
Callback Function -> เป็นเซฟรองในการคอยเตรียมวัตถุดิบต่าง ๆ เช่น การเตรียมใบกระเพรา การซอยพริก การซอยกระเทียม
Higher-Order  Function -> เป็นเซฟหลักในการที่คอยเอาวัตถุดิบต่าง ๆ มาปรุงอาหารเพื่อให้กลายเป็นข้าวผัดกระเพรา
*/
